results/local/hey_get_medium.txt

Summary:
  Total:	180.2904 secs
  Slowest:	1.3851 secs
  Fastest:	0.0018 secs
  Average:	0.2159 secs
  Requests/sec:	925.7177
  
  Total data:	36869430 bytes
  Size/request:	221 bytes

Response time histogram:
  0.002 [1]	|
  0.140 [277]	|
  0.278 [153649]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.417 [11846]	|■■■
  0.555 [342]	|
  0.693 [285]	|
  0.832 [215]	|
  0.970 [83]	|
  1.108 [43]	|
  1.247 [34]	|
  1.385 [55]	|


Latency distribution:
  10% in 0.1823 secs
  25% in 0.1882 secs
  50% in 0.1996 secs
  75% in 0.2306 secs
  90% in 0.2685 secs
  95% in 0.2894 secs
  99% in 0.3629 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 1.3851 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0047 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.2159 secs, 0.0018 secs, 1.3850 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0085 secs

Status code distribution:
  [200]	166830 responses

Error distribution:
  [1]	Get "http://localhost/get": read tcp [::1]:63853->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63854->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63855->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63856->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63857->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63858->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63859->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63860->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63861->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63862->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63863->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63864->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63865->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63866->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63867->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63868->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63869->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63870->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63871->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63872->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63873->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63874->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63875->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63876->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63877->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63878->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63879->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63880->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63881->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63882->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63883->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63884->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63885->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63886->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63887->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63888->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63889->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63890->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63891->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63892->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63893->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63894->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63895->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63896->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63897->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63898->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63899->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63900->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63901->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63902->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63903->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63904->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63905->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63906->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63907->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63908->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63909->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63910->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:63911->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64056->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64058->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64059->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64062->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64064->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64066->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64072->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64074->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/get": read tcp [::1]:64076->[::1]:80: read: connection reset by peer